{"title":"Elewayte Offer Letter - Anshu Kumar Bishwas with signature.pdf","contents":["Address: \n#111,2nd Floor, 27th Main Road \n2nd Sector, HSR Layout, Bengaluru, \nKarnataka 560102 \n \n \n \n \n+91 6383453564 \n \n \n \n \n \n \nINTERNSHIP OFFER LETTER \n \n \n3 December 2023 OL Number: ELWT587 \n \n \nDear Anshu Kumar Bishwas, \n \nWelcome  to  Elewayte!  We  are  excited  to  have  you  join  us  as  a Business  Development \nTrainee. This letter confirms our offer for a 6 month internship, commencing on 5 January","Trainee. This letter confirms our offer for a 6 month internship, commencing on 5 January \n2024 and  concluding  on 11  July  2024,  with  the potential  for  extension  based  on  your \nperformance. \n➔ Role: Business Development Trainee \n➔ Training Period: 5 January 2024 - 11 January 2024 \n➔ On the Job Training (OJT): 12 January 2024 - 11 July 2024 \n➔ Location: Bangalore \n➔ Compensation: ₹ 17000 stipend + performance linked pay of ₹ 10000 \n➔ Placement Type: Internship + Placement","➔ Placement Type: Internship + Placement \n \nCompensation: \nYour internship will be rewarded with a monthly stipend of ₹ 17000. Additionally, you have \nthe  opportunity  to  earn performance  incentives  up  to  ₹  10000, contingent  upon  the \nachievement of predetermined revenue targets. \nFor  detailed  insight  into  how  these  performance-linked  incentives  can  be  attained,  please \nrefer to Annexure - 1. This annex provides a comprehensive breakdown of the targets and","refer to Annexure - 1. This annex provides a comprehensive breakdown of the targets and \nthe   corresponding   incentive   structure,   guiding   you  towards  maximizing   your   earnings \npotential during your internship. \ninfo@elewayte.com","+91 6383453564 \ninfo@elewayte.com \n Address: \n#111,2nd Floor, 27th Main Road \n2nd Sector, HSR Layout, Bengaluru, \nKarnataka 560102 \n \n \n \nInternship Role and Expectations: \nDuring  your  tenure,  you  will  be  immersed  in  various business  development  activities, \nassisting  our  team  in market  research,  client  engagement,  and  project  initiatives.  We \nanticipate your innovative contributions and dedication to learning and growth. \nWorking Hours:","anticipate your innovative contributions and dedication to learning and growth. \nWorking Hours: \nYou will  be  expected  to  work 8  hours  per  day. Your regular  working  hours  will  be  from 11 \nAM to 8 PM, Tuesday through Sunday. \nPerformance Targets: \nAs  an  integral  part  of  our  team,  your  contributions  will  be  pivotal  in  achieving  our  business \ngoals.   You   will   be   entrusted   with   a revenue  target  of  ₹  150,000.00. We  foster   a","goals.   You   will   be   entrusted   with   a revenue  target  of  ₹  150,000.00. We  foster   a \nperformance-driven culture where meeting at least 60 - 70  %  of  this  target  is  considered \nthe  minimum  acceptable  performance  threshold. Regular  feedback  sessions will  be \nscheduled  to  review  your  progress  towards  these  goals  and  to  support  your  ongoing \nprofessional  development.  It  is  our  intent  to  not  only  drive  business  success  but  also  to","facilitate a robust learning experience for you. \nTraining and Development: \nYou  will  participate  in  a structured  training  program designed  to  equip  you  with  the \nnecessary  skills  and  knowledge  for  a  successful  internship. Regular  check-ins  with  your \nmentor will help you stay on track and maximize your learning experience. \nCompany Policies: \nAs an intern, you will adhere to all company policies and maintain the confidentiality of","As an intern, you will adhere to all company policies and maintain the confidentiality of \nproprietary information. Your conduct should reflect the high standards of Elewayte. \nCompletion and Potential Opportunities: \nUpon successful  completion  of  your  internship,  there  will  be  a performance  review, \nwhich may lead to opportunities for further engagement with our team, including potential \nfull-time employment.","+91 6383453564 \ninfo@elewayte.com \n Address: \n#111,2nd Floor, 27th Main Road \n2nd Sector, HSR Layout, Bengaluru, \nKarnataka 560102 \n \n \n \nNext Steps: \nTo accept this internship offer, sign  and  date this  letter, then reply  back  a  scanned  copy \nof  the  signed  document, along with the requested  documents  in  Annexure - 2, within 2 \nworking days from the receipt of this email. Should we not receive your acceptance within","working days from the receipt of this email. Should we not receive your acceptance within \nthe specified timeline, the offer will be considered as automatically withdrawn without any \nfurther obligation on the part of Elewayte. \nIf you have any questions or require further clarification on any aspect of this offer, please do \nnot hesitate to reach out to Priyanka at 6383453564. \nWith Regards, \nMadhukar M \nGM - Human Resources \n(This is an auto generated email and does not require signature)","GM - Human Resources \n(This is an auto generated email and does not require signature)","+91 6383453564 \ninfo@elewayte.com \n Address: \n#111,2nd Floor, 27th Main Road \n2nd Sector, HSR Layout, Bengaluru, \nKarnataka 560102 \n \n \n \n \nNote: \n1. All  the  above  said  figures  are  subjected  to  full  recovery  of  the  projected  revenue,  defaults \nand  quality  checks  by  the  post  sales  department.  Initially  50%  of  the  performance  linked  pay \nwill  be  remitted  post  the  quality  checks  with  a  tolerance  of  85%  of  the  remaining  PLP  will  be \nremitted.","remitted. \n2. At  any  time  if  you  wish  to  discontinue  the  training  due  to  personal  reasons  ,  you  would  be \nrequired  to  inform  us  30  Days prior. If  you  are  unable  to  inform  us  30  days  prior  you  will  be \nlevied with 1 month of compensation as part of pay in lieu. \n3. The company has all the rights to make amendments to the pattern from time to \ntime and would be informed to the concerned as well.","time and would be informed to the concerned as well. \n4. It is important to note that failing to meet performance expectations may result \nin deductions to your compensation. \n5. Specifically, not achieving at least 70% of the projected revenue may lead to a \ncorresponding reduction in your compensation package. \n6. Any changes pertaining to the compensation and the structure of the pay is fully \nunder  the  control  of  the employer. The  employee  would  be  ratified  of  any  such","under  the  control  of  the employer. The  employee  would  be  ratified  of  any  such \nchanges through an official form of communication. \n7. The training period, an essential part of your career growth, is unpaid. However, \nthe  skills  and  experience  acquired  are  crucial  for  your  future  success  in  the \ncompany. \n \nWith Regards, \nMadhukar M \nGM - Human Resources \n(This is an auto generated email and does not require signature)","+91 6383453564 \ninfo@elewayte.com \n Address: \n#111,2nd Floor, 27th Main Road \n2nd Sector, HSR Layout, Bengaluru, \nKarnataka 560102 \n \n \n \n \nAnnexure - 1 \n \n \n \nVariable Compensation Breakdown \nIn this annexure, we've detailed the variable component structure for one of the crucial roles \nwithin  our  organization:  sales-focused  roles.  It's  essential  to  understand  and  align  with  the \nspecific  breakdown  relevant  to  your  role  to  ensure  transparency  and  clarity  regarding  your","compensation. \n \nThis is applicable for individuals whose primary responsibility revolves around in house sales \nefforts, achieving sales targets, and maintaining customer relationships. \n \n \n \nVARIABLE COMPONENT (B) BREAK UP - SALES \nTARGET : ₹ 150,000.00 \nSl No Target Achievement Incentive Payout - PLP \n1 Above Primary Target Determined as % of overachievement X \n₹ 10000 (PLP) \n2 Exactly ₹ 2,20,000 ₹ 10,000 \n3 Up to ₹ 1,80,000 ₹ 7,500 \n4 Up to ₹ 1,50,000 ₹ 5,000","Address: \n#111,2nd Floor, 27th Main Road \n2nd Sector, HSR Layout, Bengaluru, \nKarnataka 560102 \n \n \n \n \n \n+91 6383453564 \n \n \n \n \n \n \nAnnexure - 2 \n \n \n \nLIST OF DOCUMENT TO ATTACH IN THE ACCEPTANCE EMAIL \n \n \n1 \nProfessional / Educational Certificates and Mark Sheets towards: \n• 10th standard or equivalent examination (Carry Original MS for Verification) \n• 12th standard or equivalent examination (Carry Original MS for Verification) \n• Graduation \n• Post-graduation / Doctorate","• Graduation \n• Post-graduation / Doctorate \n2 Copy of Passport Size Photograph \n3 PAN Card + Voter ID or Driving License \n \n4 \nPass Book Front page with below mentioned Details : \nBank Account Details: Bank Name, Your Name as per Bank records, Account \nNumber, IFSC Code \n \n \n \n \nOnboarding Requirement: \nBring an original document for verification purposes at the time of onboarding. \ninfo@elewayte.com"]}