{"title":"CIS Engineer Trainee (IT Sevice Desk) - Job description .pdf","contents":["Engineer \nTrainee -\nIT Service Desk","©2024 Cognizant. All rights reserved.\nAbout Cognizant\nJob title\nEngineer Trainee\nLocation\nBengaluru, Chennai, Coimbatore. Candidate must be flexible to relocate to any Cognizant work \nlocations as per the business requirement & demand.\n19\nFortune Modern Board 25\nJune 2023\nNamed to\nForbes World’s Best\nEmployer list\nOct 2023\n3\nLinkedIn top companies India \nApr 2024\n24\nFortune’s Sector Leaders list \nfor Technology\nJuly 2024","©2024 Cognizant. All rights reserved.\nJob description\nIT Service Desk has witnessed significant transformations due to technological \nadvancements. Today, many organizations leverage AI chat bots to automate and \nstreamline their support processes. AI chat bots use natural language processing to \nprovide instant responses to common user queries and handle simple tasks, reducing the \nworkload on human analysts. Robotic Process Automation (RPA) is also gaining traction,","workload on human analysts. Robotic Process Automation (RPA) is also gaining traction, \nallowing repetitive and rule-based tasks to be automated, freeing up analysts' time for more \ncomplex issues.\n•Provide first-line technical support and assistance to end-users, addressing their IT-\nrelated issues and enquiries, log and track all support tickets, ensuring accurate \ndocumentation and timely resolution of problems.","documentation and timely resolution of problems.\n•Troubleshoot hardware and software problems, performing diagnosis and resolving \ntechnical issues to minimize downtime, collaborate with other IT teams to escalate \ncomplex issues and ensure prompt resolution and to maintain knowledge base articles \nand documentation to enhance self-service options and facilitate efficient problem-\nsolving.\nKey responsibilities\nCompensation\nINR 4,00,000 per annum\nRole expectations","solving.\nKey responsibilities\nCompensation\nINR 4,00,000 per annum\nRole expectations\n•Associate should be client focused and able to work with users from different \ncommunities and cultures across the globe.\n•Ability to have flawless communication (verbal and written) with our clients and possess \nsound technical knowledge.\n•Work in shifts and work from office.\nSupport available from Cognizant (post joining as Full Time Employee)\n•Night shift allowance will be paid by the project.","•Night shift allowance will be paid by the project.\n•Cognizant provide cabs for pick-up and drop, ensuring safety and comfort.\n•Timely rewards and recognition for top performers.\nIf you are passionate about customer service, possess strong technical skills, and thrive in a \nfast-paced environment, then this role is for you.\nIT Service Desk is a centralized team that provides technical support to \nour clients, including troubleshooting and resolution of IT issues and","our clients, including troubleshooting and resolution of IT issues and \nensuring smooth functioning of their Computer Systems and IT Services. \nAs many as 90 global clients across different continents are supported \nby 15,000 strong Service Desk team, across the globe. The landscape of","©2024 Cognizant. All rights reserved.\nRegistration\nHiring process\nOne stop registration\nScreening\nRound 1\n(Online)\nCommunication \nassessment\nIf cleared\nAll shortlisted candidates will appear for \nCommunication assessment\nIf selected\nFull-time offer\nIf cleared\nRound 2\n(Online)\nAptitude \nassessment\nTechnical interview\nAll shortlisted candidates will appear for \ntechnical interview\nIf cleared\nRound 3\n(Online)","©2024 Cognizant. All rights reserved.\nEligibility Criteria\n•At the time of registration, consistent academic record of a minimum \nof 50% in X, XII, Diploma, UG & PG with no standing arrears in \ncurrent education.\nStudent Information\n•At the time of joining, all recruits need to have a minimum 50% aggregate in the \npursuing degree with no standing arrears.\n•Opportunities are open to Indian nationals / OCIs who are currently residing in \nIndia.","•Opportunities are open to Indian nationals / OCIs who are currently residing in \nIndia.\n•Flexible to relocate to anywhere in India, work in any shift / technology / domain, \nincluding work from office location basis business requirements.\nMandatory documents for registration:Registration link will be shared candidates must  scan \nand upload the below mentioned documents while registering: \n•Resume (maximum of 2 pages) with a high-resolution passport size photograph. Please note","•Resume (maximum of 2 pages) with a high-resolution passport size photograph. Please note \nthat the photograph should be clicked in a light background and both the ears of the \ncandidates must be visible.\nMandatory documents for interview\n•All academic documents including the college ID card, and school/college UG mark sheets.\nMandatory  documents for onboarding\n•The final Cognizant onboarding would be subject to satisfactory background verification.","•The final Cognizant onboarding would be subject to satisfactory background verification.\n•If PAN card is already available, ensure you have both first name and last name updated in \nthe PAN card. If you do not have your last name updated in the PAN card kindly get it \nupdated. Background verification will not be successful if last name is not updated in the \nPAN card. Background verification will not be successful if the PAN card name and the","PAN card. Background verification will not be successful if the PAN card name and the \nsuperset registered name is not matching. If PAN card is not available, kindly do not proceed \nwith the application registration\n•Voter Id card / Passport will be mandatory to verify citizenship.\nPlease note: Students will get the communications only to the registered mail ID in Superset. \nIt must be their personal mail ID and shall be considered as the primary email ID. This email","It must be their personal mail ID and shall be considered as the primary email ID. This email \nID should not be changed at any point during hiring process or until Full Time Employment \n(FTE) onboarding.\n•Cognizant does not entertain payments of any kind from candidates or vendors for employment. Requests for such payments should be promptly reported to \nGenCHRComplianceIND@cognizant.com.","GenCHRComplianceIND@cognizant.com.\n•If you encounter anyone who claims to offer jobs at Cognizant in return for any benefit (monetary or non-monetary), please do not entertain them. Please be informed \nthat Cognizant shall not be held responsible for any such instances or payments you make. \n•We recommend that you do not respond to spam emails/ messages you do not trust; never disclose your personal or financial details to anyone you do not know. If","any such mails purporting to come from Cognizant are received, we advise you to contact us at GenCHRComplianceIND@cognizant.com.\n•Cognizant takes its hiring practices seriously and appreciates you keeping the Company informed of any individuals posing as Cognizant employees who make false \njob offers using Cognizant’s name. We remind you that while recruiting employees, Cognizant will only communicate with you through authentic Cognizant email","addresses and Cognizant will never extend any job offers to anyone based on an online application without first conducting an in-person, video, or telephone interview \nthrough verified encrypted channels.\n•To ascertain that you are receiving a genuine call from Cognizant, please ensure to collect the recruiter’s details (full name; official email id, employee ID & mobile \nnumber) during the call.\nDisclaimer:\n•2024 Batch of B.E/B.Tech of any branch (UG full time degree).","number) during the call.\nDisclaimer:\n•2024 Batch of B.E/B.Tech of any branch (UG full time degree).\nImportant: If selected, you will join as a fresher as no prior work experience will be considered."]}