{"title":"Updated_Anshu_new-Final-resume.pdf","contents":["Anshu Kumar Bishwas \nPortfolio: anshu-bishwas-portfolio \n         anshubishwas0@gmail.com \nEducation \nSikkim Manipal Institute of Technology Aug 2020 – June 2024 \nBachelor of Technolo gy in Informatio n   Technolo gy : [CGPA: 8.11] Majitar, Sikkim \n \nRelevant Coursework \n• \nData Structures \n• \nWeb Development \nExperience\n \n• \nAlgorithm s Analysis \n• \nDatabase Management \n \n• \nArtificial Intelligence \n• \nInternet Technology \n \n• \nSystems Programming \n• \nComputer Architecture","• \nInternet Technology \n \n• \nSystems Programming \n• \nComputer Architecture \n \nDigital Integrity Jan 2024 – May 2024 \nFrontend  Developer  (Intern)                  Remote \n• \nDeveloped   a  comprehen si ve hotel rooms  bookin g manage me nt   system with  user-friend ly   interfaces ,   real-time \nbookin g   checks,   and  secure user  authen tic atio n,   leveragin g   AJAX,  PHP,  and  MySQL.\n \n•","• \nCreated a robust admin  panel for efficient management  of settings,  facilities,  rooms,  and guest  feedback, ensuring seamless data  \n             interaction  and  real-time updates \n \nSigmamind  Research  Labs Pvt.  Ltd Nov 2024 – Current \nFull-Stack Developer (Intern)       —     https://thepotato ai .co m       |    Produchunt Remote \n• \nDeveloped Potato AI, an AI-powered search tool designed to enhance web exploration. Built  using Next.js,","React.js, Node.js, and Supabase  Authentication,  it  supports both anonymous and authenticated users. The tool  leverages  \n    machine learning  algorithms  like similarity  searching and embeddings  to provide precise answers with cited  sources while  \n    while ensuring user privacy. \n• \nKey features include All Mode,  which fetches the most  relevant search results across the web; Writing  Assistant Mode,  an","AI-driven tool for creative and professional writing  without  internet searches; and Academic  Search  Mode,  which  \n    simplifies  access to research papers and academic articles.  Authenticated users can access their library  history for a  \n    personalized experience, and users can also select an AI model to optimize  their search for more efficient and intelligent  \n    results. \n \nTechnical Skills \nLanguages: C/C++, Java, HTML/CSS, JavaScript, PHP, SQL,","results. \n \nTechnical Skills \nLanguages: C/C++, Java, HTML/CSS, JavaScript, PHP, SQL, \nDeveloper Tools: VS Code, Git,  Github, Chrome DevTools, MySQL, Postman,  MongoDB Atlas, Dialogflow \nTechnologies/Frameworks: React.js, Next.js, Node.js,  Express.js, Tailwind  CSS,  Shadcn, REST  API  \nMiscellaneous  Skills: Problem solving,  Learning attitude,  Teamwork, Communication,   Adaptability \n \nProjects","Projects \nBanjara — Link — Source | HTML/CSS, JavaScript,   No d e,j s ,   Dia lo g f lo w  Feb 2023 – May 2023 \n• \nDeveloped a Dialogflow travel chatbot with  a custom  web interface supporting  text and  voice inputs for Sikkim  travel  \n    information.  Implemented  diverse intents for destinations,  activities,  packages,  essentials,  seasons,  pricing, and routes.  \n    Integrated  with  a Node.js  server using webhook for robust communication  with  Dialogflow.","Integrated  with  a Node.js  server using webhook for robust communication  with  Dialogflow. \nHungryEye — Link — Source | MERN     Feb 2024 – May 2024 \n• Developed a full-stack online food ordering web app using React  JS, MongoDB, Express, Node.js,  and Stripe.  The app \n    includes a user- friendly frontend for browsing and ordering food, an admin  panel for managing  items  and orders, and a","backend server for API requests. Features include JWT-based user authentication,  shopping  cart functionality,  secure \n    payments  via Stripe, and  comprehensive order management. \nMoviezer — Link — Source | React.js,   Redux,  SCSS                                                                                        April 2021 – June 2021 \n• Developed Movie &  TV Show  Search  Platform using React.js and TMDB  API, enabling  users to search movies and  TV  shows,  explore","popular,  trending, and upcoming  titles,  and  view detailed pages  with  cast,  trailers,  and ratings.  Also  Implemented  personalized content \n \n             suggestions  and  fine-tuned filters for genre, release date, and ratings  to  enhance user experience. \n \nCertifications \n• \nThe  MER N   Fullstac k   Guide by  Academind \n \n• \nWeb Development  Bootcamp(2023)  by  Dr. Angela  Yu\n \n• \nMastering  Data  Structures & Algorithms by Abdul bari \n \n \n   +91 7667411679","• \nPrinciples, Computational  tools  and  Case studies  with  Data  Science and Machine Learning (Manipal  University Jaipur) \n• \n8-week online training  on Web Development (Internshala)"]}