{"title":"CN-Network Layer-2 (2).pdf","contents":["Link   State  Routing  Protocol (LSR) \n \nDraw back with DVR protocol \n-Slow convergence  \n-Count to infinity Problem \nThe idea behind link state routing is fairly simple and can be stated as five parts. Each router \nmust do the following things to make it work- \n1. Discover its neighbors and learn their network addresses. \n2. Set the distance or cost metric to each of its neighbors. \n3. Construct a packet telling all it has just learned.","3. Construct a packet telling all it has just learned. \n4. Send this packet to and receive packets from all other routers. \n5. Compute the shortest path to every other router. \nSo,  the  complete  topology  is  distributed  to  every  router. Once  the  topology  is  known,  then \nDijkstra’s algorithm can be run at each router to find the shortest path to every other router. \n \n \nLearning about the Neighbors","Learning about the Neighbors \n \n Every router sends a special HELLO packet on each point-to-point line. The router on the \nother end is expected to send back a reply giving its name. \n \n \n  \nFigure1: (a)  A broadcast LAN. (b) A graph model of (a) [1]","Setting Link Costs \n The link state routing algorithm requires each link to have a distance or cost metric for \nfinding shortest paths. \n A common choice is to make the cost inversely proportional to the bandwidth of the \nlink. \n If the network is geographically spread out, the delay of the links may be factored into \nthe cost so that paths over shorter links are better choices. \n The most direct way to determine this delay is to send over the line a special ECHO packet"," The most direct way to determine this delay is to send over the line a special ECHO packet \nthat  the  other  side  is  required  to  send  back  immediately.  By  measuring  the  round-trip \ntime and dividing it by two, the sending router can get a reasonable estimate of the delay. \n \nBuilding Link State Packets \n Once  the  information  needed  for  the  exchange  has  been  collected,  each  router    builds a \npacket containing all the data.","packet containing all the data. \n The Packet contains the following information \n-Identity of the router \n-Sequence no \n-Age \n-List of neighbors and costs \n \n \nFigure2: (a) A subnet.  (b) The link state packets for this subnet [1] \n \nWhen to build link state packet- \n-Periodically","-When some significant event occurs such as –link failure, node failure \n \nDistributing the Link State Packets \n \n \nFigure3: The packet buffer for router B in Figure 2(a). \n \nThe data structure used by router  B for the network shown in Figure 2(a) is depicted in \nFigure 3. Each row here corresponds to a recently arrived, but as yet not fully processed, \nlink state packet. The table records where the packet originated, its sequence number and","link state packet. The table records where the packet originated, its sequence number and \nage, and the data. In addition, there are send and acknowledgement flags for each of B’s \nthree links (to A, C, and F, respectively). \n The send flags mean that the packet must be sent on the indicated link. \n The acknowledgement flags mean that it must be acknowledged there. \n \nIn Figure3, the link state packet from A arrives directly, so it must be sent to  C and F and","In Figure3, the link state packet from A arrives directly, so it must be sent to  C and F and \nacknowledged  to  A,  as  indicated  by  the  flag  bits.  Similarly,  the  packet from  F  has  to  be \nforwarded to A and C and acknowledged to F.  \nHowever, the situation with the third packet, from E, is different. It arrives  twice, \nonce  via  EAB  and  once  via  EFB.  Consequently,  it  has  to  be  sent  only  to  C but  must  be \nacknowledged to both A and F, as indicated by the bits.","acknowledged to both A and F, as indicated by the bits. \nIf a duplicate arrives while the original is still in the buffer, bits have to be changed. \nFor example, if a copy of C’s state arrives from F before the fourth entry in the table has \nbeen forwarded, the six bits will be changed to 100011 to indicate that the packet must be \nacknowledged to F but not sent there.","Computing the New Routes \nOnce a router has accumulated a full set of link state packets, it can construct the entire network \ngraph because every link is represented.  \n \nEvery  link  is,  in  fact, represented  twice,  once  for  each  direction.  The  different  directions  may \neven have  different  costs.  The  shortest-path  computations  may  then  find  different  paths   rom \nrouter A to B than from router B to A.","router A to B than from router B to A. \n \nNow Dijkstra’s algorithm can be run locally to construct  the  shortest  paths  to all  possible \ndestinations.  The  results  of  this  algorithm  tell  the  router  which  link  to use  to  reach  each \ndestination. This information is installed in the routing tables, and normal operation is resumed. \n \nComparison with DVR: \n-Requires more memory and computation intensive. \n-However, it does not suffer from slow convergence problem","-However, it does not suffer from slow convergence problem \n \n \n \nAssignments: \n1. Explain the working principle of RIP protocol. Mention the drawbacks. \n2. What is OSPF protocol? Explain how routing takes place in OSPF.   \n \n \nReference \n1. A.S. Tanenbaum & D.J. Wetherall, “Computer Networks”, Pearson"]}