{"title":"Frontend Developer Intern Hiring Assignment.pdf","contents":["CodeAnt AI\nFrontend Developer Intern Hiring Assignment\nOverview\nCodeAnt AI is a Y Combinator-backed startup revolutionizing the code quality and security industry. By \nleveraging AI-driven and deterministic fixes, we simplify coding, making it cleaner, safer, and more efficient. \nTrusted by leading unicorns and supported by top Silicon Valley investors, CodeAnt AI tackles complex \nproblems and pushes the boundaries of innovation.","problems and pushes the boundaries of innovation. \nWe are looking for passionate and talented individuals to join us as Frontend Developer Interns to help \ndesign and build intuitive user interfaces for our cutting-edge products.\nObjective\nTo evaluate candidates' ability to code and deliver a functional frontend implementation based on a \nprovided design.\nDeliverables\n£A fully coded frontend implementation of the design provided in the Figma file","Deliverables\n£A fully coded frontend implementation of the design provided in the Figma file\n£The implementation should use ReactJS, HTML, and CSS, adhering to best practices for clean, \nmaintainable, and scalable code\n£A GitHub link to the repository containing the complete code\n£Any supporting documentation or instructions for running the project locally.","Figma Link: \nFrontend Developer – CodeAnt Figma Design\nDeadline\nCandidates are required to submit their completed assignment by 26 December 2024, 11:59 PM.\nEvaluation Criteria\n£Code Quality: Clean, readable, and maintainable code\n£Adherence to Design: Accuracy in implementing the Figma design\n£Functionality: Ensuring the frontend components work seamlessly\n£Performance: Optimized and responsive UI/UX\n£Responsiveness: The design must be responsive across devices and screen sizes","£Responsiveness: The design must be responsive across devices and screen sizes\n£Creativity and Problem-Solving: Efficient solutions to potential challenges during implementation\n£Timeliness: Submission within the stipulated deadline.","Ready to build the future of code with us? Apply now! \nAdditional Information\n£If you encounter any issues, please contact us at \n£Submission Link: \nutkarsh.panwar@codeant.aV\nhttps://forms.gle/ef1hT8qVL5YXi3ybA"]}